Repository: phw/peek
Catalog: po/*.po
Languages: pl

source: Show the version of the program and exit
pl: Pokaż wersję programu i wyjdź

source: Select the recording backend (gnome-shell, ffmpeg)
pl: Wybierz mechanizm nagrywania (gnome-shell, ffmpeg)

source: Start recording in all running Peek instances
pl: Rozpocznij nagrywanie we wszystkich uruchomionych instancjach Peek

source: Stop recording in all running Peek instances
pl: Zatrzymaj nagrywanie we wszystkich uruchomionych instancjach Peek

source: Toggle recording in all running Peek instances
pl: Przełącz nagrywanie we wszystkich uruchomionych instancjach Peek

source: Start Peek without the header bar
pl: Uruchom Peek bez paska tytułowego

source: Unable to initialize default recording backend: %s
pl: Nie można zainicjować domyślnego backendu nagrywania: %s

source: Unable to initialize recording backend %s: %s
pl: Nie można zainicjować backendu nagrywania: %s:%s

source: Recording backend unavailable
pl: Backend nagrywania jest niedostępny

source: Native Wayland backend is unsupported
pl: Natywny backend Wayland'a nie jest wspierany

source: You are running Peek natively on Wayland, this is currently unsupported. Please start Peek using XWayland by setting <tt>GDK_BACKEND=x11</tt>. For Details see the Peek <a href='https://github.com/phw/peek#why-no-native-wayland-support'>FAQ about Wayland support</a>.
pl: Używasz Peek natywnie na Wayland, obecnie nie jest to obsługiwane. Proszę uruchomić Peek używając XWayland, ustawiając <tt>GDK_BACKEND=x11</tt>. Aby uzyskać szczegółowe informacje, zapoznaj się z <a href='https://github.com/phw/peek#why-no-native-wayland-support'>FAQ o obsłudze Wayland</a>.

source: Peek requires FFmpeg or running GNOME Shell session.
pl: Peek wymaga FFmpeg lub uruchomienia sesji powłoki GNOME.

source: FFmpeg executable not found.
pl: Nie znaleziono pliku wykonywalnego FFmpeg.

source: An unexpected error occurred during recording. Recording was aborted.
pl: Wystąpił nieoczekiwany błąd podczas nagrywania. Nagrywanie zostało przerwane.

source: Rendering animation…
pl: Renderowanie animacji…

source: Peek will close when rendering is finished.
pl: Peek zostanie zamknięty po zakończeniu renderingu.

source: Record as %s
pl: Nagraj jako %s

source: Rendering…
pl: Renderowanie…

source: Recording could not be started due to an unexpected error.
pl: Nie można rozpocząć nagrywania z powodu nieoczekiwanego błędu.

source: Save animation
pl: Zapisz animację

source: _Save
pl: _Zapisz

source: _Cancel
pl: _Anuluj

source: The file could not be saved to the selected location.
pl: Plik nie mógł zostać zapisany w wybranym miejscu.

source: Animation saved as “%s”
pl: Animacja zapisana jako „%s”

source: Click here to show the saved file in your file manager.
pl: Kliknij tutaj, aby wyświetlić zapisany plik w menedżerze plików.

source: Show in file manager
pl: Pokaż w menedżerze plików

source: deactivated
pl: zdezaktywowany

source: Change
pl: Zmień

source: Press keys…
pl: Wciśnij klawisze…

source: Animated GIF recorder
pl: Animowana nagrywarka GIF

# Translator credits in about dialog
source: translator-credits
pl: Dawid Dziurla <dawidd0811@gmail.com> Kuba Niewiarowski <jakub@niewiarowski.it> Szylu <chipolade@gmail.com>

source: Start recording
pl: Zacznij nagrywać

source: New window
pl: Nowe okno

source: Set window size
pl: Ustaw rozmiar okna

source: Preferences
pl: Preferencje

source: About Peek
pl: O programie

source: Stop recording
pl: Przestań nagrywać

source: _Record
pl: _Nagraj

source: Recording error
pl: Błąd nagrywania

source: Close
pl: Zamknij

source: Please read the <a href="https://github.com/phw/peek#frequently-asked-questions">FAQs</a> before reporting this issue. If the FAQs do not answer your issue please report it and provide as much details as possible on what you were doing when the issue occurred.
pl: Przed zgłoszeniem tego problemu przeczytaj <a href="https://github.com/phw/peek#frequently-asked-questions">FAQ</a>. Jeśli odpowiedzi na najczęściej zadawane pytania nie odpowiadają na Twój problem, zgłoś go i podaj jak najwięcej szczegółów na temat tego, co robiłeś w momencie wystąpienia problemu.

source: Show details
pl: Pokaż szczegóły

source: User interface
pl: Interfejs użytkownika

source: Open file manager after saving
pl: Otwórz menedżera plików po zapisaniu

source: Show desktop notification after saving
pl: Pokaż powiadomienie na pulpicie po zapisaniu

source: Start / stop recording
pl: Zacznij / przestań nagrywać

source: Recording
pl: Nagrywanie

source: Output format
pl: Format wyjściowy

source: Use gifski for high quality GIFs
pl: Użyj gifski dla wysokiej jakości plików GIF

source: GIF quality
pl: Jakość GIF-a

source: Framerate
pl: Częstotliwość wyświetlania klatek

source: Resolution downsampling
pl: Próbkowanie rozdzielczości

source: Delay in seconds before recording starts
pl: Opóźnienie w sekundach przed rozpoczęciem nagrywania

source: Capture mouse cursor
pl: Uchwyć kursor

source: Capture sound from default PULSE device
pl: Nagrywaj dźwięk z domyślnego urządzenia PULSE

source: Peek preferences
pl: Preferencje Peek

source: Cancel
pl: Anuluj

source: Set size
pl: Ustaw rozmiar

source: Width
pl: Szerokość

source: Height
pl: Wysokość

source: Record short animated GIF images from your screen
pl: Nagraj krótkie animowane obrazy GIF z twojego ekranu

source: screencast;screen recorder;screen capture;GIF;WebM;APNG;
pl: screencast;rejestrator ekranu;przechwytywanie ekranu;GIF;WebM;APNG;

source: Simple screen recorder with an easy to use interface
pl: Prosty rejestrator ekranu z łatwym w użyciu interfejsem

source: Features:
pl: Funkcje:

source: Select a screen region to record
pl: Wybierz obszar ekranu do nagrywania

source: Save recorded video as an optimized animated GIF
pl: Zapisz nagrane wideo jako zoptymalizowany, animowany GIF

source: Record directly to WebM format
pl: Nagrywaj bezpośrednio do formatu WebM

source: Simple user interface optimized for the task
pl: Prosty interfejs użytkownika zoptymalizowany do zadania

source: Automatically downscale recorded videos
pl: Automatyczne skalowanie w dół nagranych materiałów

source: Support for HiDPI screens
pl: Wsparcie dla ekranów HiDPI

source: Works inside a GNOME Shell Wayland session (using XWayland)
pl: Działa wewnątrz sesji GNOME Shell Wayland (używanie XWayland)

source: Peek is not a general purpose screencast app with extended features but rather focuses on the single task of creating small, silent screencasts of an area of the screen for creating GIF animations or silent WebM videos.
pl: Peek nie jest aplikacją nagrywającą ekran ogólnego zastosowania z rozbudowanymi funkcjami, ale skupia się na pojedynczym tworzeniu małych, nagrań bez dźwięku z określonego obszaru ekranu do tworzenia animacji GIF lub filmów WebM lub MP4.

source: The main window to select the recording area
pl: Główne okno do wyboru obszaru nagrywania

source: Peek's preferences dialog
pl: Okno preferencji Peek

source: Peek is recording itself
pl: Peek nagrywa sam siebie

source: Time in milliseconds for which the recording area size is displayed after resizing stops.
pl: Czas w milisekundach, dla którego obszar nagrywania jest wyświetlany po zmianie rozmiaru ogranicznika.

source: Default file name used. Can include date format specifiers. The extension will be added automatically.
pl: Użyto domyślnej nazwy pliku. Można dołączyć specyfikatory formatu daty. Rozszerzenie będzie dodane automatycznie.

source: Prefer dark theme
pl: Preferuj ciemny motyw

source: Global keybinding to toggle recording
pl: Globalne klawisze do przełączania nagrywania

source: Output file format
pl: Wyjściowy format pliku

source: Quality setting for the gifski GIF encoder
pl: Ustawienia jakości kodera GIF-ów gifski

source: Resolution downsampling factor
pl: Współczynnik próbkowania rozdzielczości

source: Whether to capture the mouse cursor
pl: Czy przechwycić kursor myszy

source: Whether to capture sound from default PULSE input device
pl: Określa, czy przechwytywać dźwięk z domyślnego urządzenia wejściowego PULSE

source: Size and position of the last open main window
pl: Rozmiar i pozycja ostatnio otwartego okna głównego

source: Path where last video got saved
pl: Ścieżka, w której zapisano ostatni film
